EDT/УТ/src/Documents/новаЗаправкаГСМ/новаЗаправкаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>новаЗаправкаГСМ</name>
  <registerRecords>AccumulationRegister.новаОстаткиГСМ</registerRecords>
  <attributes>
    <name>АЗС</name>
    <type>
      <types>CatalogRef.новаАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заправки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Бак</name>
      <type>
        <types>CatalogRef.новаБакиТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГСМ</name>
      <type>
        <types>CatalogRef.новаНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутевойЛист</name>
      <type>
        <types>DocumentRef.новаПутевойЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/новаОстаткиГСМ/новаОстаткиГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>новаОстаткиГСМ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПутевойЛист</name>
    <type>
      <types>DocumentRef.новаПутевойЛист</types>
    </type>
  </attributes>
  <dimensions>
    <name>Бак</name>
    <type>
      <types>CatalogRef.новаБакиТранспорта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/новаЗаправкаГСМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка заполнения
	Перем Заголовок;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	спОшибки = Новый Массив;
	// Проверка заполнения шапки
	СтруктураОбязательныхПолей = Новый Структура("АЗС");
	Для Каждого ОбязательноеПоле Из СтруктураОбязательныхПолей Цикл
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ОбязательноеПоле.Ключ]) Тогда
			спОшибки.Добавить("  Не заполнен реквизит "+ОбязательноеПоле.Ключ+".");
		КонецЕсли;
	КонецЦикла;
		
	СтруктураОбязательныхПолей = Новый Структура("Транспорт, Бак, Количество, Дата");
	Для Каждого СтрокаЗаправки из Заправки Цикл
		Для Каждого ОбязательноеПоле Из СтруктураОбязательныхПолей Цикл
			Если Не ЗначениеЗаполнено(СтрокаЗаправки[ОбязательноеПоле.Ключ]) Тогда
				спОшибки.Добавить("  В строке номер " + СтрокаЗаправки.НомерСтроки +" не заполнен реквизит "+ОбязательноеПоле.Ключ+".");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если спОшибки.Количество() <> 0 Тогда
		Отказ = Истина;
		Сообщить(Заголовок,СтатусСообщения.Важное);
		Для Каждого Ошибка из спОшибки Цикл
			Сообщить(Ошибка);
		КонецЦикла;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ, РежимПроведения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, РежимПроведения)
	
	// Движения по регистру ОстаткиГСМ
	Для Каждого СтрокаЗаправки Из Заправки Цикл
		Движение = Движения.новаОстаткиГСМ.ДобавитьПриход();
		Движение.Период		 = СтрокаЗаправки.Дата + (СтрокаЗаправки.Время - НачалоДня(СтрокаЗаправки.Время));
//		Движение.Транспорт	 = СтрокаЗаправки.Транспорт;
		Движение.Бак		 = СтрокаЗаправки.Бак;
		Движение.Количество  = СтрокаЗаправки.Количество;
		Движение.Стоимость	 = СтрокаЗаправки.Сумма;
		Движение.ПутевойЛист = СтрокаЗаправки.ПутевойЛист;
	КонецЦикла;
	
КонецПроцедуры
